In [1]:
#from google.colab import drive
#drive.mount('/content/drive')

In [2]:
import pandas as pd
import numpy as np

In [3]:
# Reading the dataset
df = pd.read_csv("Social_Network_Ads.csv")
df.head()

    User ID             Name            Phone  Gender  Age  Salary  Purchase
0  15624510  José Eduardo181  +1 202-918-2132    Male   19   19000         0
1  15810944          Milo271  +1 202-918-2133    Male   35   20000         0
2  15668575        Jayson808  +1 202-918-2134  Female   26   43000         0
3  15603246       Mariana775  +1 202-918-2135  Female   27   57000         0
4  15804002      Gregorio366  +1 202-918-2136    Male   19   76000         0

In [4]:
df.shape

(400, 7)

In [5]:
df.describe()

            User ID         Age         Salary    Purchase
count  4.000000e+02  400.000000     400.000000  400.000000
mean   1.569154e+07   37.655000   69742.500000    0.357500
std    7.165832e+04   10.482877   34096.960282    0.479864
min    1.556669e+07   18.000000   15000.000000    0.000000
25%    1.562676e+07   29.750000   43000.000000    0.000000
50%    1.569434e+07   37.000000   70000.000000    0.000000
75%    1.575036e+07   46.000000   88000.000000    1.000000
max    1.581524e+07   60.000000  150000.000000    1.000000

In [6]:
# Checking unique counts in each row
df.nunique()

User ID     400
Name        374
Phone       400
Gender        2
Age          43
Salary      117
Purchase      2
dtype: int64

In [7]:
# Checking if dataset includes null values
df.isnull().sum()

User ID     0
Name        0
Phone       0
Gender      0
Age         0
Salary      0
Purchase    0
dtype: int64

In [8]:
df = df.drop('User ID',axis=1)
df = df.drop('Name',axis=1)
df = df.drop('Phone',axis=1)

In [9]:
df.Gender = df.Gender.map({'Male': 1, "Female": 0})

In [10]:
df.head()

   Gender  Age  Salary  Purchase
0       1   19   19000         0
1       1   35   20000         0
2       0   26   43000         0
3       0   27   57000         0
4       1   19   76000         0

In [11]:
from sklearn.preprocessing import StandardScaler
from sklearn.metrics import accuracy_score
from sklearn.ensemble import RandomForestClassifier
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split

In [12]:
X = df.drop('Purchase', axis=1)
Y = df['Purchase']
    
# feature Scaling
scale_x = StandardScaler()
x = scale_x.fit_transform(X)
x_train,x_test,y_train,y_test = train_test_split(X,Y,test_size=0.2,random_state=0)

In [13]:
rfc=RandomForestClassifier(criterion= 'entropy',max_depth= 4,max_features= 'auto',n_estimators= 200)
rfc.fit(x_train, y_train)
pred=rfc.predict(x_test)

In [14]:
print("Accuracy for Random Forest on Test data: ",accuracy_score(y_test,pred))

Accuracy for Random Forest on Test data:  0.95

In [15]:
rfc.predict([[0,27,10000]])

array([0], dtype=int64)

In [16]:
import joblib
import pickle

# save the model to disk
filename = 'finalized_model.sav'
pickle.dump(rfc, open(filename, 'wb'))